# -*- coding: utf-8 -*-
"""Untitled0.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1RmEmQU-F3ici87TFsR3Ee-O7s-4xUbwe
"""

import pandas as pd

"""1. Прочесть с помощью pandas файл
california_housing_test.csv, который находится в папке
sample_data


"""

df = pd.read_csv('sample_data/california_housing_train.csv')

"""2. Посмотреть сколько в нем строк и столбцов

"""

df.shape

"""3. Определить какой тип данных имеют столбцы"""

df.dtypes

"""1. Проверить есть ли в файле пустые значения


"""

df.isnull()

df.isnull().sum()

"""2. Показать median_house_value где median_income < 2

"""

df.columns

df[df['median_income'] < 2]['median_house_value']

"""3. Показать данные в первых 2 столбцах

"""

df.head(2)

"""4. Выбрать данные где housing_median_age < 20 и
median_house_value > 70000
"""

df[(df['housing_median_age']<20) & (df['median_house_value'] > 7000)]

"""1. Определить какое максимальное и минимальное
значение median_house_value

"""

df['median_house_value'].max()

print(df['median_house_value'].min())

"""2. Показать максимальное median_house_value, где
median_income = 3.1250

"""

df[df['median_income'] == 3.1250]['median_house_value'].max()

"""3. Узнать какая максимальная population в зоне
минимального значения median_house_value
"""

df[df['median_house_value'] == df['median_house_value'].min()]['population'].max()

"""Задача 40: Работать с файлом california_housing_train.csv, который находится в папке
sample_data. Определить среднюю стоимость дома, где кол-во людей от 0 до 500 (population)

"""

df[(df['population'] < 500) & (df['population'] > 0)] ['median_house_value'].mean()

"""Задача 42: Узнать какая максимальная households в зоне минимального значения population"""

df[df['population'] == df['population'].min()]['households'].max()